categorical-analysis/best-starbase-ever.org
#+TITLE: Best Starbase Ever
* Best Starbase Ever / Лучшая Звездная База Во Вселенной
[[https://github.com/Tiendil/world-builders-2023/blob/main/categorical-analysis/best-starbase-ever.org][Исходники]]

В документе описано три сущности:

- Вселеленная — кратко, для контекста.
- Сеттинг — категориальный анализ.
- Продукт — кратко, для контекста.

[[https://tiendil.org/fictional-universe-setting-work-what-the-difference/][Логика описания раскрыта в блоге]].
** Вселенная
- Абсурдный космос, в котором возможно всё.
- Вселенная насыщена объектами: аномалиями, пришельцами, событиями, руинами.
- Путешествия на большие расстояния возможны только через врата «предыдущих цивилизаций».
- Врат бесконечно много. Они бывают разные по размерам и другим свойствам.
- Если знаешь ключ от врат, можешь перейти в их локацию через другие врата.
- Цивилизация концетрируется вокруг врат: базы, города, флоты, сражения — всё вокруг них.
- В больших поселениях творится полный Вавилон: множество рас, культур, технологий.
- Кто знает больше полезных координат врат, тот правит локальным мирком, так как может лучше организовать торговлю и добычу ресурсов.
- Самые крутые профессии: торговцы и +вратологи+ первопроходцы.
- Первопроходцы исследуют новые врата: вводят случайные координаты и смотрят куда их занесёт.
- За большинством врат развалины и горы лута от предыдущих цивилизаций.
- Лут бесконечно превосходит то, что умеют выпускать. Никто не знает как он работает. Поэтому производства нет, выгоднее грабить руины.
** Сеттинг
*** Время
Не имеет значения
*** Жанр
Absurd Sci-Fi Tales of Valor and Unity / Абсурдные научно-фантастические истории о доблести и единстве
**** Варианты
- Absurd Space Friendship Saga
- Absurd Tales of Space Brotherhood
- Absurd Galactic Exploration Chronicles
*** Референсы
**** Основные
***** [[https://ru.wikipedia.org/wiki/Fairy_Tail][Fairy Tail]]                                                                :manga:animation_series:
Близкое по духу развитие гильдии и её членов.
***** [[https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B9_%D0%BF%D1%83%D1%82%D1%8C:_%D0%93%D0%BB%D1%83%D0%B1%D0%BE%D0%BA%D0%B8%D0%B9_%D0%BA%D0%BE%D1%81%D0%BC%D0%BE%D1%81_9][Star Trek: Deep Space Nine]]                                                :book:video_series:
Жизнь космической станции, вокруг которой бурлит жизнь.
***** [[https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B9_%D0%BF%D1%83%D1%82%D1%8C:_%D0%9D%D0%B8%D0%B6%D0%BD%D0%B8%D0%B5_%D0%BF%D0%B0%D0%BB%D1%83%D0%B1%D1%8B][Star Trek: Lower Decks]]                                                    :video_series:
Безбашенная пати, которая исследует космос.
***** [[https://ru.wikipedia.org/wiki/%D0%94%D0%BE%D0%BA%D1%82%D0%BE%D1%80_%D0%9A%D1%82%D0%BE][Doctor Who]]                                                                :video_series:
Модель путешествия и построения сюжетов: телепортируемся в неизвестность, встречаем очередное сумасшествие, решаем проблему, возвращаемся.
***** [[https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B5_%D0%B2%D1%80%D0%B0%D1%82%D0%B0][Stargate]]                                                                  :video_series:
Модель путешествия, источник вдохновения для сюжетов.
***** [[https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B5_%D0%B4%D0%BD%D0%B5%D0%B2%D0%BD%D0%B8%D0%BA%D0%B8_%D0%98%D0%B9%D0%BE%D0%BD%D0%B0_%D0%A2%D0%B8%D1%85%D0%BE%D0%B3%D0%BE][Звёздные Дневники Ийона Тихого]]                                            :book:video_series:
Желаемый уровень абсурдности.
***** [[https://ru.wikipedia.org/wiki/One_Piece._%D0%91%D0%BE%D0%BB%D1%8C%D1%88%D0%BE%D0%B9_%D0%BA%D1%83%D1%88][One Piece]]                                                                 :manga:animation_series:video_series:
Задор руководителя бардака, ещё один пример гильдии.
***** [[https://ru.wikipedia.org/wiki/Darkest_Dungeon][Darkest Dungeon]]                                                           :game:
Приключения не проходят бесследно.
**** Видео
***** [[https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B9_%D0%BF%D1%83%D1%82%D1%8C][Star Trek ]]                                                                :video_series:movie:book:
**** TODO Игры
**** TODO Книги
***** [[https://ru.wikipedia.org/wiki/%D0%A1%D0%B5%D1%80%D0%B8%D1%8F_%D1%80%D0%BE%D0%BC%D0%B0%D0%BD%D0%BE%D0%B2_%D0%BE_%D0%93%D0%B0%D1%80%D1%80%D0%B8_%D0%9F%D0%BE%D1%82%D1%82%D0%B5%D1%80%D0%B5][Гарри Поттер]]                                                              :book:video_series:
***** [[https://ru.wikipedia.org/wiki/%D0%9D%D0%B0%D1%80%D1%83%D1%82%D0%BE][Naruto]]                                                                    :manga:animation_series:
**** TODO Комиксы
*** Герои
**** Глава гильдии
**** Член гильдии первопроходцев
**** Первопроходец-одиночка
**** Бесполезный компанейский товарищ
**** Бармен
**** Торговец
**** Проныра
**** Большой дружелюбный инопланетянин
**** Ветеран на пенсии
**** Космический пират
**** Космический мусорщик
**** Механик-самоучка
**** Инженер-самоделкин
**** Грабитель
**** Космическая сущность (Q, Галактус, Иисус)
**** Киборг
**** Автономный ИИ
**** Большой ИИ (корабль, станция, город)
**** Боец звёздного флота
**** Коллекционер артефактов
**** Сумасшедший учёный
**** Враждебный инопланетянин
**** Травмированный герой
**** Попрошайка
**** Космический сирота
**** Потерявшийся во вселенной путешественник
**** Представитель правопорядка/власти
*** Истории
**** Мы строим гильдию
**** Исследование неизвестного
**** Путь к успеху
**** Взросление
**** Борьба с собой
**** Соперничество между гильдиями
**** Производственный роман
**** От соперничества к дружбе
**** Первый контакт
**** Археологические раскопки
**** Разграбление руин
**** Поиск предтеч
**** Борьба за власть в полисе
**** Ограбление на миллион
**** Предательство/подстава
**** Хотели как лучше, получилось как всегда
**** Противостояние жестоким захватчикам
**** Поиск сокровищ или артефакта (лекарства, оружия, технологии)
**** Противостояние окружающей среде
**** Хаотичная гильдия vs переформализованная местная власть
**** Борьба колоний с метрополиями
*** Признаки
**** Технологии неотличимые от магии
**** Все — инопланетяне
**** Все — мигранты
**** Технологичный лут
**** Аномалии
**** Космические врата
**** Космические базы
**** Экзоскелет
**** Экипировка из космического мусора
**** [[https://ru.wikipedia.org/wiki/%D0%9F%D0%BE%D0%BB%D0%B8%D1%81_(%D0%B0%D0%BD%D1%82%D0%B8%D1%87%D0%BD%D0%BE%D1%81%D1%82%D1%8C)][Полисная]] государственная структура
**** Военщина
**** Необычная биология
**** Необычная социальная организация
**** Чуждая мораль
**** Враждебная окружающая среда
**** Необычная физика
*** Якоря реального мира
**** Становление и испытание дружбы
**** Рост над собой, развитие
**** Команда «стартапа»
**** Межличностные конфликты на работе
**** Diversity/Разнообразие
**** Black Mirror сюжеты
За вратами может быть любая ситуация из возможного будущего нашего мира.
**** Борьба колоний с метрополиями
** Первый продукт
*** Одной строкой
Я построю свою космостанцию с баром и наёмниками.
*** Описание
- Симулятор развития гильдии первопроходцев и её уголка во вселенной с возможностью асинхронного мультиплеера.
- Игрок формирует группы первопроходцев и отправляет их в разведку за врата.
- Разведка происходит автоматически, как движение персонажей через серию событий. Исходы событий влияют на персонажей и отношения между ними.
- Если результаты разведки понравились, можно установить постоянную связь с новым местом и получить его бонусы.
- Найденный лут игрок использует для улучшения гильдии, базы и окружающего мира.
- Доступные возможности зависят от того, в какую сторону игрок развивается, с какими местами соединяет врата.
- Создать универсальную самую крутую базу невозможно.
- Игроки могут соединить свои базы через врата, получая доступ к части возможностей друг друга.
- МАКСИМАЛЬНОЕ использование процедурной генерации.
** Заметки
- В теории, можно сильно завязаться на социальную сеть steam, построив мультиплеер и монетизацию вокруг неё. Например, разрешать связывать базы только друзьям на стиме. Разрешать друзьям играть бесплатно, если их базы соединены и один из них купил игру.
