categorical-analysis/best-starbase-ever.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-01 śro 21:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Best Starbase Ever</title>
<meta name="author" content="tiendil" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Best Starbase Ever</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org142ebbc">1. Best Starbase Ever / Лучшая Звездная База Во Вселенной</a>
<ul>
<li><a href="#org595d919">1.1. Вселенная</a></li>
<li><a href="#org902bdd7">1.2. Сеттинг</a>
<ul>
<li><a href="#org1e6de8a">1.2.1. Время</a></li>
<li><a href="#org8d5ecf5">1.2.2. Жанр</a></li>
<li><a href="#org3a06f00">1.2.3. Референсы</a></li>
<li><a href="#org61b86d4">1.2.4. Герои</a></li>
<li><a href="#orgb18aca2">1.2.5. Истории</a></li>
<li><a href="#org2af4292">1.2.6. Признаки</a></li>
<li><a href="#orgdc9f7ad">1.2.7. Якоря реального мира</a></li>
</ul>
</li>
<li><a href="#orgadca98d">1.3. Первый продукт</a>
<ul>
<li><a href="#org0756ff1">1.3.1. Одной строкой</a></li>
<li><a href="#orgc314ddf">1.3.2. Описание</a></li>
</ul>
</li>
<li><a href="#orgd1ead4d">1.4. Заметки</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org142ebbc" class="outline-2">
<h2 id="org142ebbc"><span class="section-number-2">1.</span> Best Starbase Ever / Лучшая Звездная База Во Вселенной</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/Tiendil/world-builders-2023/blob/main/categorical-analysis/best-starbase-ever.org">Исходники</a>
</p>

<p>
В документе описано три сущности:
</p>

<ul class="org-ul">
<li>Вселеленная — кратко, для контекста.</li>
<li>Сеттинг — категориальный анализ.</li>
<li>Продукт — кратко, для контекста.</li>
</ul>

<p>
<a href="https://tiendil.org/fictional-universe-setting-work-what-the-difference/">Логика описания раскрыта в блоге</a>.
</p>
</div>
<div id="outline-container-org595d919" class="outline-3">
<h3 id="org595d919"><span class="section-number-3">1.1.</span> Вселенная</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Абсурдный космос, в котором возможно всё.</li>
<li>Вселенная насыщена объектами: аномалиями, пришельцами, событиями, руинами.</li>
<li>Путешествия на большие расстояния возможны только через врата «предыдущих цивилизаций».</li>
<li>Врат бесконечно много. Они бывают разные по размерам и другим свойствам.</li>
<li>Если знаешь ключ от врат, можешь перейти в их локацию через другие врата.</li>
<li>Цивилизация концетрируется вокруг врат: базы, города, флоты, сражения — всё вокруг них.</li>
<li>В больших поселениях творится полный Вавилон: множество рас, культур, технологий.</li>
<li>Кто знает больше полезных координат врат, тот правит локальным мирком, так как может лучше организовать торговлю и добычу ресурсов.</li>
<li>Самые крутые профессии: торговцы и <del>вратологи</del> первопроходцы.</li>
<li>Первопроходцы исследуют новые врата: вводят случайные координаты и смотрят куда их занесёт.</li>
<li>За большинством врат развалины и горы лута от предыдущих цивилизаций.</li>
<li>Лут бесконечно превосходит то, что умеют выпускать. Никто не знает как он работает. Поэтому производства нет, выгоднее грабить руины.</li>
</ul>
</div>
</div>
<div id="outline-container-org902bdd7" class="outline-3">
<h3 id="org902bdd7"><span class="section-number-3">1.2.</span> Сеттинг</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org1e6de8a" class="outline-4">
<h4 id="org1e6de8a"><span class="section-number-4">1.2.1.</span> Время</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Не имеет значения
</p>
</div>
</div>
<div id="outline-container-org8d5ecf5" class="outline-4">
<h4 id="org8d5ecf5"><span class="section-number-4">1.2.2.</span> Жанр</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Absurd Sci-Fi Tales of Valor and Unity / Абсурдные научно-фантастические истории о доблести и единстве
</p>
</div>
<ol class="org-ol">
<li><a id="org45028d2"></a>Варианты<br />
<div class="outline-text-5" id="text-1-2-2-1">
<ul class="org-ul">
<li>Absurd Space Friendship Saga</li>
<li>Absurd Tales of Space Brotherhood</li>
<li>Absurd Galactic Exploration Chronicles</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org3a06f00" class="outline-4">
<h4 id="org3a06f00"><span class="section-number-4">1.2.3.</span> Референсы</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
<ol class="org-ol">
<li><a id="orga6a6848"></a>Основные<br />
<ol class="org-ol">
<li><a id="org12e638f"></a><a href="https://ru.wikipedia.org/wiki/Fairy_Tail">Fairy Tail</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="manga">manga</span>&#xa0;<span class="animation_series">animation_series</span></span><br />
<div class="outline-text-6" id="text-1-2-3-1-1">
<p>
Близкое по духу развитие гильдии и её членов.
</p>
</div>
</li>
<li><a id="org738fd25"></a><a href="https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B9_%D0%BF%D1%83%D1%82%D1%8C:_%D0%93%D0%BB%D1%83%D0%B1%D0%BE%D0%BA%D0%B8%D0%B9_%D0%BA%D0%BE%D1%81%D0%BC%D0%BE%D1%81_9">Star Trek: Deep Space Nine</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span>&#xa0;<span class="video_series">video_series</span></span><br />
<div class="outline-text-6" id="text-1-2-3-1-2">
<p>
Жизнь космической станции, вокруг которой бурлит жизнь.
</p>
</div>
</li>
<li><a id="org27c501e"></a><a href="https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B9_%D0%BF%D1%83%D1%82%D1%8C:_%D0%9D%D0%B8%D0%B6%D0%BD%D0%B8%D0%B5_%D0%BF%D0%B0%D0%BB%D1%83%D0%B1%D1%8B">Star Trek: Lower Decks</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="video_series">video_series</span></span><br />
<div class="outline-text-6" id="text-1-2-3-1-3">
<p>
Безбашенная пати, которая исследует космос.
</p>
</div>
</li>
<li><a id="org2accd84"></a><a href="https://ru.wikipedia.org/wiki/%D0%94%D0%BE%D0%BA%D1%82%D0%BE%D1%80_%D0%9A%D1%82%D0%BE">Doctor Who</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="video_series">video_series</span></span><br />
<div class="outline-text-6" id="text-1-2-3-1-4">
<p>
Модель путешествия и построения сюжетов: телепортируемся в неизвестность, встречаем очередное сумасшествие, решаем проблему, возвращаемся.
</p>
</div>
</li>
<li><a id="orga73a8df"></a><a href="https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B5_%D0%B2%D1%80%D0%B0%D1%82%D0%B0">Stargate</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="video_series">video_series</span></span><br />
<div class="outline-text-6" id="text-1-2-3-1-5">
<p>
Модель путешествия, источник вдохновения для сюжетов.
</p>
</div>
</li>
<li><a id="orga29a206"></a><a href="https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B5_%D0%B4%D0%BD%D0%B5%D0%B2%D0%BD%D0%B8%D0%BA%D0%B8_%D0%98%D0%B9%D0%BE%D0%BD%D0%B0_%D0%A2%D0%B8%D1%85%D0%BE%D0%B3%D0%BE">Звёздные Дневники Ийона Тихого</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span>&#xa0;<span class="video_series">video_series</span></span><br />
<div class="outline-text-6" id="text-1-2-3-1-6">
<p>
Желаемый уровень абсурдности.
</p>
</div>
</li>
<li><a id="org2fea239"></a><a href="https://ru.wikipedia.org/wiki/One_Piece._%D0%91%D0%BE%D0%BB%D1%8C%D1%88%D0%BE%D0%B9_%D0%BA%D1%83%D1%88">One Piece</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="manga">manga</span>&#xa0;<span class="animation_series">animation_series</span>&#xa0;<span class="video_series">video_series</span></span><br />
<div class="outline-text-6" id="text-1-2-3-1-7">
<p>
Задор руководителя бардака, ещё один пример гильдии.
</p>
</div>
</li>
<li><a id="orgc552a9d"></a><a href="https://ru.wikipedia.org/wiki/Darkest_Dungeon">Darkest Dungeon</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="game">game</span></span><br />
<div class="outline-text-6" id="text-1-2-3-1-8">
<p>
Приключения не проходят бесследно.
</p>
</div>
</li>
</ol>
</li>
<li><a id="org2e1e646"></a>Видео<br />
<ol class="org-ol">
<li><a id="orga0d75ca"></a><a href="https://ru.wikipedia.org/wiki/%D0%97%D0%B2%D1%91%D0%B7%D0%B4%D0%BD%D1%8B%D0%B9_%D0%BF%D1%83%D1%82%D1%8C">Star Trek </a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="video_series">video_series</span>&#xa0;<span class="movie">movie</span>&#xa0;<span class="book">book</span></span><br /></li>
</ol>
</li>
<li><a id="orgdec66f3"></a><span class="todo TODO">TODO</span> Игры<br /></li>
<li><a id="orgc46969a"></a><span class="todo TODO">TODO</span> Книги<br />
<ol class="org-ol">
<li><a id="org04957bf"></a><a href="https://ru.wikipedia.org/wiki/%D0%A1%D0%B5%D1%80%D0%B8%D1%8F_%D1%80%D0%BE%D0%BC%D0%B0%D0%BD%D0%BE%D0%B2_%D0%BE_%D0%93%D0%B0%D1%80%D1%80%D0%B8_%D0%9F%D0%BE%D1%82%D1%82%D0%B5%D1%80%D0%B5">Гарри Поттер</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span>&#xa0;<span class="video_series">video_series</span></span><br /></li>
<li><a id="orgb583218"></a><a href="https://ru.wikipedia.org/wiki/%D0%9D%D0%B0%D1%80%D1%83%D1%82%D0%BE">Naruto</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="manga">manga</span>&#xa0;<span class="animation_series">animation_series</span></span><br /></li>
</ol>
</li>
<li><a id="org3f06ca6"></a><span class="todo TODO">TODO</span> Комиксы<br /></li>
</ol>
</div>
<div id="outline-container-org61b86d4" class="outline-4">
<h4 id="org61b86d4"><span class="section-number-4">1.2.4.</span> Герои</h4>
<div class="outline-text-4" id="text-1-2-4">
</div>
<ol class="org-ol">
<li><a id="orgd54f223"></a>Глава гильдии<br /></li>
<li><a id="org575c07b"></a>Член гильдии первопроходцев<br /></li>
<li><a id="org2676f4d"></a>Первопроходец-одиночка<br /></li>
<li><a id="org3482e64"></a>Бесполезный компанейский товарищ<br /></li>
<li><a id="orgced4e52"></a>Бармен<br /></li>
<li><a id="org6ef83c9"></a>Торговец<br /></li>
<li><a id="org914b740"></a>Проныра<br /></li>
<li><a id="orgbd16996"></a>Большой дружелюбный инопланетянин<br /></li>
<li><a id="orgf52f11f"></a>Ветеран на пенсии<br /></li>
<li><a id="orga2dde4f"></a>Космический пират<br /></li>
<li><a id="org8809c3e"></a>Космический мусорщик<br /></li>
<li><a id="orgc2ce77e"></a>Механик-самоучка<br /></li>
<li><a id="org23b16ab"></a>Инженер-самоделкин<br /></li>
<li><a id="orgb438d7d"></a>Грабитель<br /></li>
<li><a id="org6f471c4"></a>Космическая сущность (Q, Галактус, Иисус)<br /></li>
<li><a id="org1128a9b"></a>Киборг<br /></li>
<li><a id="orgff8e5d9"></a>Автономный ИИ<br /></li>
<li><a id="orgef1590f"></a>Большой ИИ (корабль, станция, город)<br /></li>
<li><a id="org1d9e10a"></a>Боец звёздного флота<br /></li>
<li><a id="orgeb21947"></a>Коллекционер артефактов<br /></li>
<li><a id="org29e4a24"></a>Сумасшедший учёный<br /></li>
<li><a id="org2536d09"></a>Враждебный инопланетянин<br /></li>
<li><a id="org3229090"></a>Травмированный герой<br /></li>
<li><a id="orgbe430e2"></a>Попрошайка<br /></li>
<li><a id="org7d7d471"></a>Космический сирота<br /></li>
<li><a id="orge91783a"></a>Потерявшийся во вселенной путешественник<br /></li>
<li><a id="org790896b"></a>Представитель правопорядка/власти<br /></li>
</ol>
</div>
<div id="outline-container-orgb18aca2" class="outline-4">
<h4 id="orgb18aca2"><span class="section-number-4">1.2.5.</span> Истории</h4>
<div class="outline-text-4" id="text-1-2-5">
</div>
<ol class="org-ol">
<li><a id="org2157029"></a>Мы строим гильдию<br /></li>
<li><a id="org49ed77b"></a>Исследование неизвестного<br /></li>
<li><a id="org70b2ed4"></a>Путь к успеху<br /></li>
<li><a id="org80760c1"></a>Взросление<br /></li>
<li><a id="org14987c4"></a>Борьба с собой<br /></li>
<li><a id="org398b198"></a>Соперничество между гильдиями<br /></li>
<li><a id="org6ad31fb"></a>Производственный роман<br /></li>
<li><a id="org0831681"></a>От соперничества к дружбе<br /></li>
<li><a id="orga8703bd"></a>Первый контакт<br /></li>
<li><a id="org1f4d9b2"></a>Археологические раскопки<br /></li>
<li><a id="org68ca306"></a>Разграбление руин<br /></li>
<li><a id="orgd90d372"></a>Поиск предтеч<br /></li>
<li><a id="org1221cab"></a>Борьба за власть в полисе<br /></li>
<li><a id="org9f090bf"></a>Ограбление на миллион<br /></li>
<li><a id="org244846c"></a>Предательство/подстава<br /></li>
<li><a id="orga5811ce"></a>Хотели как лучше, получилось как всегда<br /></li>
<li><a id="org6822beb"></a>Противостояние жестоким захватчикам<br /></li>
<li><a id="orgd7676fb"></a>Поиск сокровищ или артефакта (лекарства, оружия, технологии)<br /></li>
<li><a id="orge470bf4"></a>Противостояние окружающей среде<br /></li>
<li><a id="org1dd4308"></a>Хаотичная гильдия vs переформализованная местная власть<br /></li>
<li><a id="org88628d4"></a>Борьба колоний с метрополиями<br /></li>
</ol>
</div>
<div id="outline-container-org2af4292" class="outline-4">
<h4 id="org2af4292"><span class="section-number-4">1.2.6.</span> Признаки</h4>
<div class="outline-text-4" id="text-1-2-6">
</div>
<ol class="org-ol">
<li><a id="org8da070d"></a>Технологии неотличимые от магии<br /></li>
<li><a id="org76a014e"></a>Все — инопланетяне<br /></li>
<li><a id="org671a26e"></a>Все — мигранты<br /></li>
<li><a id="org8e19fe2"></a>Технологичный лут<br /></li>
<li><a id="orge76c39c"></a>Аномалии<br /></li>
<li><a id="orgb3ed0fd"></a>Космические врата<br /></li>
<li><a id="orge928e29"></a>Космические базы<br /></li>
<li><a id="org5c22e96"></a>Экзоскелет<br /></li>
<li><a id="org2a47603"></a>Экипировка из космического мусора<br /></li>
<li><a id="org809876c"></a><a href="https://ru.wikipedia.org/wiki/%D0%9F%D0%BE%D0%BB%D0%B8%D1%81_(%D0%B0%D0%BD%D1%82%D0%B8%D1%87%D0%BD%D0%BE%D1%81%D1%82%D1%8C)">Полисная</a> государственная структура<br /></li>
<li><a id="org5bcd4c1"></a>Военщина<br /></li>
<li><a id="org874fffe"></a>Необычная биология<br /></li>
<li><a id="orge568700"></a>Необычная социальная организация<br /></li>
<li><a id="org81d255c"></a>Чуждая мораль<br /></li>
<li><a id="org756cac1"></a>Враждебная окружающая среда<br /></li>
<li><a id="org554c401"></a>Необычная физика<br /></li>
</ol>
</div>
<div id="outline-container-orgdc9f7ad" class="outline-4">
<h4 id="orgdc9f7ad"><span class="section-number-4">1.2.7.</span> Якоря реального мира</h4>
<div class="outline-text-4" id="text-1-2-7">
</div>
<ol class="org-ol">
<li><a id="org44351f5"></a>Становление и испытание дружбы<br /></li>
<li><a id="org9b40618"></a>Рост над собой, развитие<br /></li>
<li><a id="org8372677"></a>Команда «стартапа»<br /></li>
<li><a id="org615c53e"></a>Межличностные конфликты на работе<br /></li>
<li><a id="orgda5afaa"></a>Diversity/Разнообразие<br /></li>
<li><a id="orga57573b"></a>Black Mirror сюжеты<br />
<div class="outline-text-5" id="text-1-2-7-6">
<p>
За вратами может быть любая ситуация из возможного будущего нашего мира.
</p>
</div>
</li>
<li><a id="orgd1fb7d5"></a>Борьба колоний с метрополиями<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgadca98d" class="outline-3">
<h3 id="orgadca98d"><span class="section-number-3">1.3.</span> Первый продукт</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org0756ff1" class="outline-4">
<h4 id="org0756ff1"><span class="section-number-4">1.3.1.</span> Одной строкой</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Я построю свою космостанцию с баром и наёмниками.
</p>
</div>
</div>
<div id="outline-container-orgc314ddf" class="outline-4">
<h4 id="orgc314ddf"><span class="section-number-4">1.3.2.</span> Описание</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>Симулятор развития гильдии первопроходцев и её уголка во вселенной с возможностью асинхронного мультиплеера.</li>
<li>Игрок формирует группы первопроходцев и отправляет их в разведку за врата.</li>
<li>Разведка происходит автоматически, как движение персонажей через серию событий. Исходы событий влияют на персонажей и отношения между ними.</li>
<li>Если результаты разведки понравились, можно установить постоянную связь с новым местом и получить его бонусы.</li>
<li>Найденный лут игрок использует для улучшения гильдии, базы и окружающего мира.</li>
<li>Доступные возможности зависят от того, в какую сторону игрок развивается, с какими местами соединяет врата.</li>
<li>Создать универсальную самую крутую базу невозможно.</li>
<li>Игроки могут соединить свои базы через врата, получая доступ к части возможностей друг друга.</li>
<li>МАКСИМАЛЬНОЕ использование процедурной генерации.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd1ead4d" class="outline-3">
<h3 id="orgd1ead4d"><span class="section-number-3">1.4.</span> Заметки</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>В теории, можно сильно завязаться на социальную сеть steam, построив мультиплеер и монетизацию вокруг неё. Например, разрешать связывать базы только друзьям на стиме. Разрешать друзьям играть бесплатно, если их базы соединены и один из них купил игру.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: tiendil</p>
<p class="date">Created: 2023-11-01 śro 21:45</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
